SPedt_!/src/Reports/ПоискЗаказов/ПоискЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПоискЗаказов</name>
</mdclass:Report>

SPedt_!/src/Catalogs/Коробки/Коробки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Коробки</name>
  <predefined>
    <items>
      <name>БезКоробки</name>
      <description>Без коробки</description>
    </items>
  </predefined>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Догрузить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаНазначения</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>КРазбору</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаВТК</name>
    <type>
      <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтикера</name>
    <type>
      <types>EnumRef.ВидыСтикеров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусГруппыДоставки</name>
    <type>
      <types>EnumRef.СтатусыГруппыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОплаты</name>
    <type>
      <types>EnumRef.МетодыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиПредоплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьВыбралУчастник</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВзвешивания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УчастникГД</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Взвешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлениеТранзита</name>
    <type>
      <types>DocumentRef.ОтправлениеТранзита</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервогоПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНаСкладе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимоИсключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимоУдалить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусГруза</name>
    <type>
      <types>EnumRef.СтатусыОтправкиГруза</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаСбора</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыдачаТранзита</name>
    <type>
      <types>DocumentRef.ВыдачаТранзита</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОДоставке</name>
    <type>
      <types>DocumentRef.ОтчетОДоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ШК</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРПОВыбралУчастник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоставкиОплаченная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияТарифов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Пристрой</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Исключить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеУдаления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Поступило</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SPedt_!/src/Reports/ПоискЗаказов/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ОтборПоПокупке 	   = ПолучитьЗначениеОтбора(КомпоновщикНастроек,  "Покупка");
	отборПоКоробке 	   = ПолучитьЗначениеОтбора(КомпоновщикНастроек,  "Коробка");
	отборПоОрагнизатор = ПолучитьЗначениеОтбора(КомпоновщикНастроек,  "Орагнизатор");
	отборПоУчастнику   = ПолучитьЗначениеОтбора(КомпоновщикНастроек,  "Участник");
	отборПоПосылке   = ПолучитьЗначениеОтбора(КомпоновщикНастроек,  "ПОсылка");
	
	
	Запрос = новый Запрос;
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	КоробкиТранзитныхЗаказов( Запрос, ОтборПоПокупке, ОтборПоУчастнику, отборПоПосылке);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыВКоробках.Коробка КАК Коробка
		|ИЗ
		|	ЗаказыВКоробках КАК ЗаказыВКоробках";
	
	РезультатЗапроса = Запрос.Выполнить();

	КоробкиСЗаказами = новый СписокЗначений;
	Если не РезультатЗапроса.Пустой() Тогда
		КоробкиСЗаказами.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Коробка"));
		КомпоновкаДанныхПараметр  = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КоробкиСЗаказами");
		Если НЕ(КомпоновкаДанныхПараметр = Неопределено) Тогда
			КомпоновкаДанныхПараметр.Значение = КоробкиСЗаказами;
			КомпоновкаДанныхПараметр.Использование = Истина;
		КонецЕсли;		
	КонецЕсли
	
КонецПроцедуры



Функция ПолучитьЗначениеОтбора(КомпоновщикНастроек, ПолеОтбора)
	 СписокЗНаченийОтбора = новый СписокЗначений;

	Для каждого элем из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если элем.ЛевоеЗначение <> новый ПолеКомпоновкиДанных(ПолеОтбора) Тогда Продолжить; КонецЕсли;
		
		
		Если ЗначениеЗаполнено(элем.ИдентификаторПользовательскойНастройки) Тогда
			ползНастройка = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(элем.ИдентификаторПользовательскойНастройки);
			Если ползНастройка.Использование Тогда
				Если ТипЗнч(ползНастройка.ПравоеЗначение) = Тип("СписокЗначений") 	Тогда
					СписокЗНаченийОтбора = ползНастройка.ПравоеЗначение;
				Иначе	
					СписокЗНаченийОтбора.добавить(ползНастройка.ПравоеЗначение);
				КонецЕсли;
			КонецЕсли	
		ИначеЕсли	элем.Использование Тогда
			Если ТипЗнч(элем.ПравоеЗначение) = Тип("СписокЗначений") 	Тогда
				СписокЗНаченийОтбора = ползНастройка.ПравоеЗначение;
			Иначе	
				СписокЗНаченийОтбора.добавить(ползНастройка.ПравоеЗначение);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	Возврат СписокЗНаченийОтбора;
	
КонецФункции	




Функция КоробкиТранзитныхЗаказов( Запрос, ОтборПоПокупке, ОтборПоУчастнику, отборПоПосылке)
	ЕстьОтбор = (ЗначениеЗаполнено(ОтборПоПокупке) или ЗначениеЗаполнено(ОтборПоУчастнику) или ЗначениеЗаполнено(отборПоПосылке));
	
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоробкиСостав.Ссылка КАК Коробка
		|ПОМЕСТИТЬ ЗаказыВКоробках
		|ИЗ
		|	Справочник.Коробки.Состав КАК КоробкиСостав
		|ГДЕ
		|	(&ОтборПоПокупке
		|	И &ОтборПоУчастнику) или &отборПоПосылке
		|
		|СГРУППИРОВАТЬ ПО
		|	КоробкиСостав.Ссылка ";
	
	Если ЗначениеЗаполнено(отборПоПосылке) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&отборПоПосылке", "КоробкиСостав.Покупка В(&отборПоПосылке)");
		Запрос.УстановитьПараметр("отборПоПосылке", отборПоПосылке);
	Иначе	
		Запрос.УстановитьПараметр("отборПоПосылке", ЕстьОтбор);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ОтборПоПокупке) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоПокупке", "КоробкиСостав.Покупка В(&ОтборПоПокупке)");
		Запрос.УстановитьПараметр("ОтборПоПокупке", ОтборПоПокупке);
	Иначе	
		Запрос.УстановитьПараметр("ОтборПоПокупке", ЕстьОтбор);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ОтборПоУчастнику) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоУчастнику", "КоробкиСостав.Участник В(&ОтборПоУчастнику)");
		Запрос.УстановитьПараметр("ОтборПоУчастнику", ОтборПоУчастнику);
	Иначе	
		Запрос.УстановитьПараметр("ОтборПоУчастнику", ЕстьОтбор);
	КонецЕсли;	
	РезультатЗапроса = Запрос.Выполнить();
	

	
КонецФункции
